src/test/resources/fixture/payment/findAllInTenant/response/success.json

{
  "content": [
    {
      "id": "d35ac7f5-3e4f-462a-a76d-524bd3a5fd03",
      "status": "CANCELED",
      "training": {
        "id": "ae4d661a-ed70-4e36-9caf-048ee8060290",
        "name": "Basic Training"
      },
      "trainingsCount": 15,
      "validDays": 25,
      "price": 69.99,
      "currency": "UAH",
      "createdAt": "2024-02-03T10:00:00Z"
    },
    {
      "id": "d35ac7f5-3e4f-462a-a76d-524bd3a5fd02",
      "status": "COMPLETED",
      "training": {
        "id": "ae4d661a-ed70-4e36-9caf-048ee8060290",
        "name": "Basic Training"
      },
      "trainingsCount": 5,
      "validDays": 15,
      "price": 49.99,
      "currency": "USD",
      "createdAt": "2024-01-02T11:00:00Z"
    },
    {
      "id": "d35ac7f5-3e4f-462a-a76d-524bd3a5fd01",
      "status": "COMPLETED",
      "training": {
        "id": "ae4d661a-ed70-4e36-9caf-048ee8060290",
        "name": "Basic Training"
      },
      "trainingsCount": 10,
      "validDays": 30,
      "price": 99.99,
      "currency": "USD",
      "createdAt": "2024-01-01T10:00:00Z"
    }
  ],
  "pageable": {
    "pageNumber": 0,
    "pageSize": 10,
    "sort": {
      "sorted": true,
      "empty": false,
      "unsorted": false
    },
    "offset": 0,
    "paged": true,
    "unpaged": false
  },
  "last": true,
  "totalElements": 3,
  "totalPages": 1,
  "first": true,
  "size": 10,
  "number": 0,
  "sort": {
    "sorted": true,
    "empty": false,
    "unsorted": false
  },
  "numberOfElements": 3,
  "empty": false
}